core/app/Models/Model_data.php

    public function tampilUser()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_user');
        $builder->select('*');
        $builder->orderBy('idUser', 'DESC');
        return $builder->get()->getResultArray();
---
SELECT *
FROM `tbl_user`
ORDER BY `idUser` DESC

    public function cekUsername($username)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_user');
        $builder->select('*');
        $builder->Where('username', $username);
        return $builder->get()->getResultArray();
---
SELECT *
FROM `tbl_user`
WHERE `username` = 'admin'

    public function tampilPendataan()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_pendataan');
        $builder->select('*');
        $builder->join('tbl_user', 'tbl_user.idUser = tbl_pendataan.user');
        $builder->join('tbl_kode_desa', 'tbl_kode_desa.idDesa = tbl_pendataan.desa');
        $builder->join('tbl_kode_kecamatan', 'tbl_kode_kecamatan.idKecamatan = tbl_pendataan.kecamatan');
        return $builder->get()->getResultArray();
---
SELECT *
FROM `tbl_pendataan`
JOIN `tbl_user` ON `tbl_user`.`idUser` = `tbl_pendataan`.`user`
JOIN `tbl_kode_desa` ON `tbl_kode_desa`.`idDesa` = `tbl_pendataan`.`desa`
JOIN `tbl_kode_kecamatan` ON `tbl_kode_kecamatan`.`idKecamatan` = `tbl_pendataan`.`kecamatan`

    public function jumlahData()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_pendataan');
        $builder->select('*');
        return $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_pendataan`

    public function tampilDataDesa()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_kode_desa');
        $builder->select('*');
        return $builder->get()->getResultArray();
---
SELECT *
FROM `tbl_kode_desa`

    public function tampilDataKecamatan()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tbl_kode_kecamatan');
        $builder->select('*');
        return $builder->get()->getResultArray();
---
SELECT *
FROM `tbl_kode_kecamatan`