core/app/Controllers/User_.php

INSERT INTO `tbl_log` (`username`, `waktu`, `keterangan`) VALUES ('admin', '2024-11-11 08:00:35', 'Melakukan Login Admin')
---
    public function login()
    {
        $session        = session();
        $modelUser      = new Model_user;
        $modelLog       = new Model_log;
        $modelData      = new Model_data;
        $username       = $this->request->getPost('username');
        $password       = $this->request->getPost('password');
        $cekUsername    = $modelData->cekUsername($username);
        if ($cekUsername == null) {
            $dataLog = [
                'username'     => "Tidak Diketahui",
                'waktu'         => date('Y-m-d H:i:s'),
                'keterangan'    => "Melakukan Percobaan Login dengan menggunakan username " . $username
            ];
            $modelLog->insert($dataLog);
            $ses_data = [
                'status'    => "Gagal",
                'keterangan' => "Akun anda tidak ditemukan"
            ];
            $session->set($ses_data);
            return redirect()->back();
        }
        $cekPassword    = password_verify($password, $cekUsername[0]['password']);
        if ($cekPassword == true) {
            $dataLog = [
                'username'      => $cekUsername[0]['username'],
                'waktu'         => date('Y-m-d H:i:s'),
                'keterangan'    => "Melakukan Login Admin"
            ];
            $modelLog->insert($dataLog);